<a href="https://colab.research.google.com/github/albertodiazr/ClasesMaster/blob/main/Python_Data_Science.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import os
drive_loc = '/content/gdrive'
files_loc = os.path.join(drive_loc, "MyDrive", "pythondsfiles")

from google.colab import drive
drive.mount(drive_loc)

Mounted at /content/gdrive

In [ ]:
!mkdir -p {files_loc}

In [ ]:
!ls {files_loc}

csv_output.csv	example.db  excel_output.xls  s3.pkl  T100_AIRLINES.csv

In [ ]:
files_loc

'/content/gdrive/MyDrive/pythondsfiles'

# Getting started

In [2]:
import pandas as pd
import numpy as np

# Series

In [ ]:
s = pd.Series([4,7,-5,3])
type(s)

pandas.core.series.Series

In [ ]:
s

0    4
1    7
2   -5
3    3
dtype: int64

In [ ]:
s.values

array([ 4,  7, -5,  3])

In [ ]:
type(s.values)

numpy.ndarray

In [ ]:
s2 = pd.Series([1,2,4.5,7,2,23,15,8], index=list('albertod'))

In [ ]:
s2

a     1.0
l     2.0
b     4.5
e     7.0
r     2.0
t    23.0
o    15.0
d     8.0
dtype: float64

In [ ]:
s2['e'] # Ahora el Ã­ndice es una letra

7.0

In [ ]:
s2 % 2 == 0

a    False
l     True
b    False
e    False
r     True
t    False
o    False
d     True
dtype: bool

In [ ]:
s2[s2 % 2 == 0] # Filtro

l    2.0
r    2.0
d    8.0
dtype: float64

In [ ]:
s2 * 2

a     2.0
l     4.0
b     9.0
e    14.0
r     4.0
t    46.0
o    30.0
d    16.0
dtype: float64

In [ ]:
np.exp(s2)

a    2.718282e+00
l    7.389056e+00
b    9.001713e+01
e    1.096633e+03
r    7.389056e+00
t    9.744803e+09
o    3.269017e+06
d    2.980958e+03
dtype: float64

In [ ]:
s2 # No se ha modificado

a     1.0
l     2.0
b     4.5
e     7.0
r     2.0
t    23.0
o    15.0
d     8.0
dtype: float64

In [ ]:
'i' in s2

False

In [ ]:
'o' in s2

True

In [ ]:
sdata = {
    'Zaragoza': 2.5e5,
    'Sevilla': 5e5,
    'Cordoba': 3e5,
    'Madrid': 6e6
}

s3 = pd.Series(sdata)
s3

Zaragoza     250000.0
Sevilla      500000.0
Cordoba      300000.0
Madrid      6000000.0
dtype: float64

In [ ]:
s3.to_pickle(os.path.join(files_loc, "s3.pkl")) # Almacenamiento de datos de Python, guardado en Google Drive

In [ ]:
!ls {files_loc}/s3.pkl

/content/gdrive/MyDrive/pythondsfiles/s3.pkl

In [ ]:
s3 = pd.Series(sdata).sort_index() # Ordenar los datos por el Ã­ndice
s3

Cordoba      300000.0
Madrid      6000000.0
Sevilla      500000.0
Zaragoza     250000.0
dtype: float64

In [ ]:
cities = ['Cordoba', 'Madrid', 'Valencia', 'Zaragoza']

In [ ]:
s4 = pd.Series(sdata, index = cities)
s4

Cordoba      300000.0
Madrid      6000000.0
Valencia          NaN
Zaragoza     250000.0
dtype: float64

In [ ]:
pd.isnull(s4)

Cordoba     False
Madrid      False
Valencia     True
Zaragoza    False
dtype: bool

In [ ]:
pd.notnull(s4)

Cordoba      True
Madrid       True
Valencia    False
Zaragoza     True
dtype: bool

In [ ]:
s3

Cordoba      300000.0
Madrid      6000000.0
Sevilla      500000.0
Zaragoza     250000.0
dtype: float64

In [ ]:
s4

Cordoba      300000.0
Madrid      6000000.0
Valencia          NaN
Zaragoza     250000.0
dtype: float64

In [ ]:
s3 + s4

Cordoba       600000.0
Madrid      12000000.0
Sevilla            NaN
Valencia           NaN
Zaragoza      500000.0
dtype: float64

In [ ]:
s4.name = 'Population' # Cambio de nombre para los datos de la serie

In [ ]:
s4

Cordoba      300000.0
Madrid      6000000.0
Valencia          NaN
Zaragoza     250000.0
Name: Population, dtype: float64

In [ ]:
s4.index.name = 'Province' # Nombre para el Ã­ndice de la serie
s4

Province
Cordoba      300000.0
Madrid      6000000.0
Valencia          NaN
Zaragoza     250000.0
Name: Population, dtype: float64

# Dataframes

In [ ]:
dfdata = {
    'province': ['M', 'M', 'M', 'B', 'B'],
    'population': [1.5e6, 2e6, 3e6, 5e6, 1.5e6],
    'year': [1900, 1950, 2000, 1900, 2000]
}

In [ ]:
df = pd.DataFrame(dfdata)
df

  province  population  year
0        M   1500000.0  1900
1        M   2000000.0  1950
2        M   3000000.0  2000
3        B   5000000.0  1900
4        B   1500000.0  2000

In [ ]:
df2 = pd.DataFrame(dfdata, columns=['province', 'population', 'year', 'debt'])
df2

  province  population  year debt
0        M   1500000.0  1900  NaN
1        M   2000000.0  1950  NaN
2        M   3000000.0  2000  NaN
3        B   5000000.0  1900  NaN
4        B   1500000.0  2000  NaN

In [ ]:
df2.index # Python construye un Ã­ndice iterado

RangeIndex(start=0, stop=5, step=1)

In [ ]:
df2.columns

Index(['province', 'population', 'year', 'debt'], dtype='object')

In [ ]:
type(df2.columns)

pandas.core.indexes.base.Index

In [ ]:
df['population']

0    1500000.0
1    2000000.0
2    3000000.0
3    5000000.0
4    1500000.0
Name: population, dtype: float64

In [ ]:
df.population

0    1500000.0
1    2000000.0
2    3000000.0
3    5000000.0
4    1500000.0
Name: population, dtype: float64

In [ ]:
df2['2nd_language'] = np.nan # AÃ±adir una columna
df2

  province  population  year debt  2nd_language
0        M   1500000.0  1900  NaN           NaN
1        M   2000000.0  1950  NaN           NaN
2        M   3000000.0  2000  NaN           NaN
3        B   5000000.0  1900  NaN           NaN
4        B   1500000.0  2000  NaN           NaN

In [ ]:
df2['2nd_language']

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
Name: 2nd_language, dtype: float64

In [ ]:
df2.2nd_language # Error por empezar por un nÃºmero tras el punto

SyntaxError: ignored

In [ ]:
df2.index = list('abcde')
df2

  province  population  year debt  2nd_language
a        M   1500000.0  1900  NaN           NaN
b        M   2000000.0  1950  NaN           NaN
c        M   3000000.0  2000  NaN           NaN
d        B   5000000.0  1900  NaN           NaN
e        B   1500000.0  2000  NaN           NaN

In [ ]:
df2.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [ ]:
df2.loc['c']

province            M
population      3e+06
year             2000
debt              NaN
2nd_language      NaN
Name: c, dtype: object

In [ ]:
df2.loc['a':'c'] # En este caso incluye tambiÃ©n la 'c', no como en Python

  province  population  year debt  2nd_language
a        M   1500000.0  1900  NaN           NaN
b        M   2000000.0  1950  NaN           NaN
c        M   3000000.0  2000  NaN           NaN

In [ ]:
df2.loc[['c']]

  province  population  year debt  2nd_language
c        M   3000000.0  2000  NaN           NaN

In [ ]:
df2.loc[df2['year'] > 1950]

  province  population  year debt  2nd_language
c        M   3000000.0  2000  NaN           NaN
e        B   1500000.0  2000  NaN           NaN

In [ ]:
val = pd.Series([0.1, 0.6, 0.9], index = ['b', 'd', 'e'])
val

b    0.1
d    0.6
e    0.9
dtype: float64

In [ ]:
df2['debt'] = [1,0,2,0.5,0.7]
df2

  province  population  year  debt  2nd_language
a        M   1500000.0  1900   1.0           NaN
b        M   2000000.0  1950   0.0           NaN
c        M   3000000.0  2000   2.0           NaN
d        B   5000000.0  1900   0.5           NaN
e        B   1500000.0  2000   0.7           NaN

In [ ]:
df2['debt'] = val
df2

  province  population  year  debt  2nd_language
a        M   1500000.0  1900   NaN           NaN
b        M   2000000.0  1950   0.1           NaN
c        M   3000000.0  2000   NaN           NaN
d        B   5000000.0  1900   0.6           NaN
e        B   1500000.0  2000   0.9           NaN

In [ ]:
df2['capital'] = df2['province'] == 'M'
df2

  province  population  year  debt  2nd_language  capital
a        M   1500000.0  1900   NaN           NaN     True
b        M   2000000.0  1950   0.1           NaN     True
c        M   3000000.0  2000   NaN           NaN     True
d        B   5000000.0  1900   0.6           NaN    False
e        B   1500000.0  2000   0.9           NaN    False

In [ ]:
del df2['2nd_language']
df2

  province  population  year  debt  capital
a        M   1500000.0  1900   NaN     True
b        M   2000000.0  1950   0.1     True
c        M   3000000.0  2000   NaN     True
d        B   5000000.0  1900   0.6    False
e        B   1500000.0  2000   0.9    False

In [ ]:
df2['2nd_language'] = np.nan
df2

  province  population  year  debt  capital  2nd_language
a        M   1500000.0  1900   NaN     True           NaN
b        M   2000000.0  1950   0.1     True           NaN
c        M   3000000.0  2000   NaN     True           NaN
d        B   5000000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

In [ ]:
df2.T

                    a      b      c      d        e
province            M      M      M      B        B
population    1.5e+06  2e+06  3e+06  5e+06  1.5e+06
year             1900   1950   2000   1900     2000
debt              NaN    0.1    NaN    0.6      0.9
capital          True   True   True  False    False
2nd_language      NaN    NaN    NaN    NaN      NaN

In [ ]:
df2.describe()

         population    year      debt  2nd_language
count  5.000000e+00     5.0  3.000000           0.0
mean   2.600000e+06  1950.0  0.533333           NaN
std    1.474788e+06    50.0  0.404145           NaN
min    1.500000e+06  1900.0  0.100000           NaN
25%    1.500000e+06  1900.0  0.350000           NaN
50%    2.000000e+06  1950.0  0.600000           NaN
75%    3.000000e+06  2000.0  0.750000           NaN
max    5.000000e+06  2000.0  0.900000           NaN

In [ ]:
df2.count()

province        5
population      5
year            5
debt            3
capital         5
2nd_language    0
dtype: int64

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   province      5 non-null      object
 1   population    5 non-null      float64
 2   year          5 non-null      int64
 3   debt          3 non-null      float64
 4   capital       5 non-null      bool
 5   2nd_language  0 non-null      float64
dtypes: bool(1), float64(3), int64(1), object(1)
memory usage: 405.0+ bytes

In [ ]:
df2.index[1] = 'x' # Index does not support mutable operations

TypeError: ignored

In [ ]:
df2.index[1]

'b'

In [ ]:
series_temp = pd.Series([1.5, -2.5, 0, 1, 2], df2.index)
series_temp

a    1.5
b   -2.5
c    0.0
d    1.0
e    2.0
dtype: float64

In [ ]:
df2.iloc[2:]

  province  population  year  debt  capital  2nd_language
c        M   3000000.0  2000   NaN     True           NaN
d        B   5000000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

In [ ]:
s5 = pd.Series(np.arange(5), list('jduvk'))
s5

j    0
d    1
u    2
v    3
k    4
dtype: int64

In [ ]:
s6 = s5.drop(['d','k'])
s6

j    0
u    2
v    3
dtype: int64

In [ ]:
s6b = s5[s5.index.intersection(['d','k'])]
s6b

d    1
k    4
dtype: int64

In [ ]:
s5

j    0
d    1
u    2
v    3
k    4
dtype: int64

In [ ]:
s6['u'] = 7
s5

j    0
d    1
u    2
v    3
k    4
dtype: int64

In [ ]:
df2
# df2 = pd.read_pickle(os.path.join(files_loc, "df2.pkl"))

  province  population  year  debt  capital  2nd_language
a        M   1500000.0  1900   NaN     True           NaN
b        M   2000000.0  1950   0.1     True           NaN
c        M   3000000.0  2000   NaN     True           NaN
d        B   5000000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

In [ ]:
df2.drop('c')

  province  population  year  debt  capital  2nd_language
a        M   1500000.0  1900   NaN     True           NaN
b        M   2000000.0  1950   0.1     True           NaN
d        B   5000000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

In [ ]:
df2.drop('2nd_language', axis=1)

  province  population  year  debt  capital
a        M   1500000.0  1900   NaN     True
b        M   2000000.0  1950   0.1     True
c        M   3000000.0  2000   NaN     True
d        B   5000000.0  1900   0.6    False
e        B   1500000.0  2000   0.9    False

In [ ]:
df2 # No se ha modificado el dataframe original

  province  population  year  debt  capital  2nd_language
a        M   1500000.0  1900   NaN     True           NaN
b        M   2000000.0  1950   0.1     True           NaN
c        M   3000000.0  2000   NaN     True           NaN
d        B   5000000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

In [ ]:
df3 = df2.copy()
df3

  province  population  year  debt  capital  2nd_language
a        M   1500000.0  1900   NaN     True           NaN
b        M   2000000.0  1950   0.1     True           NaN
c        M   3000000.0  2000   NaN     True           NaN
d        B   5000000.0  1900   0.6    False           NaN
e        B   1500000.0  2000   0.9    False           NaN

In [ ]:
df_detour = pd.DataFrame({'x': [1,2]})

In [ ]:
df_sub = df_detour[0:1]

In [ ]:
df_sub.x = -1
df_detour

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:5170: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

   x
0 -1
1  2

In [ ]:
df3.drop('capital', axis = 1, inplace = True) # Cambio inplace, se modifica el dataframe original
df3

  province  population  year  debt  2nd_language
a        M   1500000.0  1900   NaN           NaN
b        M   2000000.0  1950   0.1           NaN
c        M   3000000.0  2000   NaN           NaN
d        B   5000000.0  1900   0.6           NaN
e        B   1500000.0  2000   0.9           NaN

In [ ]:
s3

Cordoba      300000.0
Madrid      6000000.0
Sevilla      500000.0
Zaragoza     250000.0
dtype: float64

In [ ]:
s3[['Zaragoza', 'Madrid']]

Zaragoza     250000.0
Madrid      6000000.0
dtype: float64

In [ ]:
s3[2:]

Sevilla     500000.0
Zaragoza    250000.0
dtype: float64

In [ ]:
s3['Cordoba':'Sevilla'] # slice inclusivo

Cordoba     300000.0
Madrid     6000000.0
Sevilla     500000.0
dtype: float64

In [ ]:
s3[1:2] # En este caso no es inclusivo

Madrid    6000000.0
dtype: float64

In [ ]:
s3 > 1e6

Cordoba     False
Madrid       True
Sevilla     False
Zaragoza    False
dtype: bool

In [ ]:
df3['year'] > 1950

a    False
b    False
c     True
d    False
e     True
Name: year, dtype: bool

In [ ]:
df3[df3['year'] > 1950] # Utilizado como filtro

  province  population  year  debt  2nd_language
c        M   3000000.0  2000   NaN           NaN
e        B   1500000.0  2000   0.9           NaN

In [ ]:
df3[(df3['year'] > 1950) & (df3['debt'] > 0.5)]

  province  population  year  debt  2nd_language
e        B   1500000.0  2000   0.9           NaN

In [ ]:
recent = df3['year'] > 1950
indebted = df3['debt'] > 0.5

df3[recent & indebted]

  province  population  year  debt  2nd_language
e        B   1500000.0  2000   0.9           NaN

In [ ]:
np.sqrt(df3['population'])

a    1224.744871
b    1414.213562
c    1732.050808
d    2236.067977
e    1224.744871
Name: population, dtype: float64

In [ ]:
df4 = pd.DataFrame(np.random.randn(4,3)*17 + 15, columns=list('bde'), index = list('BMPZ'))
df4

           b          d          e
B  32.614308  36.572501   8.594436
M  12.916833  28.332179   1.659541
P   5.652532  -8.099638  36.420970
Z  23.920058   2.374418  16.783768

In [ ]:
df4.apply(lambda series: series.max() - series.min()) # Aplicar una funcion

b    26.961776
d    44.672138
e    34.761429
dtype: float64

In [ ]:
df4.applymap(lambda element: element % 10)

          b         d         e
B  2.614308  6.572501  8.594436
M  2.916833  8.332179  1.659541
P  5.652532  1.900362  6.420970
Z  3.920058  2.374418  6.783768

In [ ]:
df4.apply(lambda series: series.max() - series.min(), axis = 1)

B    27.978064
M    26.672637
P    44.520607
Z    21.545640
dtype: float64

In [ ]:
def f(series):
  return pd.Series([series.max(), series.min()], index = ['max', 'min'])

df4.apply(f)

             b          d          e
max  32.614308  36.572501  36.420970
min   5.652532  -8.099638   1.659541

In [ ]:
for item in df4.items():
  print(item)

('b', B    32.614308
M    12.916833
P     5.652532
Z    23.920058
Name: b, dtype: float64)
('d', B    36.572501
M    28.332179
P    -8.099638
Z     2.374418
Name: d, dtype: float64)
('e', B     8.594436
M     1.659541
P    36.420970
Z    16.783768
Name: e, dtype: float64)

In [ ]:
for item in df4.iteritems():
  print(item)

('b', B    32.614308
M    12.916833
P     5.652532
Z    23.920058
Name: b, dtype: float64)
('d', B    36.572501
M    28.332179
P    -8.099638
Z     2.374418
Name: d, dtype: float64)
('e', B     8.594436
M     1.659541
P    36.420970
Z    16.783768
Name: e, dtype: float64)

In [ ]:
df4

           b          d          e
B  32.614308  36.572501   8.594436
M  12.916833  28.332179   1.659541
P   5.652532  -8.099638  36.420970
Z  23.920058   2.374418  16.783768

In [ ]:
df4.sort_index(ascending=True)

           b          d          e
B  32.614308  36.572501   8.594436
M  12.916833  28.332179   1.659541
P   5.652532  -8.099638  36.420970
Z  23.920058   2.374418  16.783768

In [ ]:
df4.sort_index(ascending=False)

           b          d          e
Z  23.920058   2.374418  16.783768
P   5.652532  -8.099638  36.420970
M  12.916833  28.332179   1.659541
B  32.614308  36.572501   8.594436

In [ ]:
df4.sort_index(ascending=False, axis=1)

           e          d          b
B   8.594436  36.572501  32.614308
M   1.659541  28.332179  12.916833
P  36.420970  -8.099638   5.652532
Z  16.783768   2.374418  23.920058

In [ ]:
df4.sort_values(by='e')

           b          d          e
M  12.916833  28.332179   1.659541
B  32.614308  36.572501   8.594436
Z  23.920058   2.374418  16.783768
P   5.652532  -8.099638  36.420970

In [ ]:
df4.sort_values(by=['e', 'b'])

           b          d          e
M  12.916833  28.332179   1.659541
B  32.614308  36.572501   8.594436
Z  23.920058   2.374418  16.783768
P   5.652532  -8.099638  36.420970

In [ ]:
s1 = pd.Series([2,3,8,4,3,2,1], index = list('abcdefg'))
s1

a    2
b    3
c    8
d    4
e    3
f    2
g    1
dtype: int64

In [ ]:
s1.sort_values()

g    1
a    2
f    2
b    3
e    3
d    4
c    8
dtype: int64

In [ ]:
s1.rank() # Cuando el elemento no es entero es que estÃ¡ igualado con otros

a    2.5
b    4.5
c    7.0
d    6.0
e    4.5
f    2.5
g    1.0
dtype: float64

In [ ]:
pd.Series([1,1,1]).rank()

0    2.0
1    2.0
2    2.0
dtype: float64

In [ ]:
salaries = pd.Series([150000, 90000, 120000, 30000, 100000, 5000, 40000, 50000, 80000, 35000, 27000, 14000])
salaries

0     150000
1      90000
2     120000
3      30000
4     100000
5       5000
6      40000
7      50000
8      80000
9      35000
10     27000
11     14000
dtype: int64

In [ ]:
ranking = salaries.sort_values(ascending=False)
ranking

0     150000
2     120000
4     100000
1      90000
8      80000
7      50000
6      40000
9      35000
3      30000
10     27000
11     14000
5       5000
dtype: int64

In [ ]:
ranking[0:10] # Los 10 mejor pagados

0     150000
2     120000
4     100000
1      90000
8      80000
7      50000
6      40000
9      35000
3      30000
10     27000
dtype: int64

In [ ]:
# El 10% de los mejor pagados

def top_earners(serie):
  number_to_extract = round(len(salaries) / 10)
  return salaries.sort_values()[-number_to_extract:]

top_earners(salaries)

0    150000
dtype: int64

In [ ]:
def top_earners(salaries, percentile=0.9):
  is_top_earner = salaries.rank(pct=True) > percentile
  return salaries[is_top_earner]

print(top_earners(salaries))

0    150000
2    120000
dtype: int64

In [ ]:
print(top_earners(salaries, 0.8))

0    150000
2    120000
4    100000
dtype: int64

In [ ]:
x = pd.Series([1.2, np.nan, 4, np.nan, 9], index= list('abcde'))
y = pd.Series([5,3,7,np.nan, 14], index = list('abcde'))

In [ ]:
df = pd.DataFrame([x,y], index=['x','y']).T
df

     x     y
a  1.2   5.0
b  NaN   3.0
c  4.0   7.0
d  NaN   NaN
e  9.0  14.0

In [ ]:
df.sum(axis=1)

a     6.2
b     3.0
c    11.0
d     0.0
e    23.0
dtype: float64

In [ ]:
df.mean()

x    4.733333
y    7.250000
dtype: float64

In [ ]:
s7 = pd.Series(list('gtacaaaafffkag'))
s7

0     g
1     t
2     a
3     c
4     a
5     a
6     a
7     a
8     f
9     f
10    f
11    k
12    a
13    g
dtype: object

In [ ]:
s7.unique()

array(['g', 't', 'a', 'c', 'f', 'k'], dtype=object)

In [ ]:
s7.value_counts()

a    6
f    3
g    2
c    1
t    1
k    1
dtype: int64

In [ ]:
puric_bases = ['g', 'a']

In [ ]:
s7.isin(puric_bases)

0      True
1     False
2      True
3     False
4      True
5      True
6      True
7      True
8     False
9     False
10    False
11    False
12     True
13     True
dtype: bool

In [ ]:
s7[s7.isin(puric_bases)]

0     g
2     a
4     a
5     a
6     a
7     a
12    a
13    g
dtype: object

In [ ]:
string_data = pd.Series(['Ma', 'Lu', 'Ca', 'Va', np.nan])
string_data

0     Ma
1     Lu
2     Ca
3     Va
4    NaN
dtype: object

In [ ]:
string_data[~string_data.isnull()]

0    Ma
1    Lu
2    Ca
3    Va
dtype: object

In [ ]:
df5 = pd.DataFrame([[1,2,3],[np.nan,8,7],[4, np.nan, 90],[67,42,53]],columns=list('abc'))
df5

      a     b   c
0   1.0   2.0   3
1   NaN   8.0   7
2   4.0   NaN  90
3  67.0  42.0  53

In [ ]:
df5[df5['a'].notnull()]

      a     b   c
0   1.0   2.0   3
2   4.0   NaN  90
3  67.0  42.0  53

In [ ]:
df5.notnull()

       a      b     c
0   True   True  True
1  False   True  True
2   True  False  True
3   True   True  True

In [ ]:
df5.notnull().any()

a    True
b    True
c    True
dtype: bool

In [ ]:
df5.notnull().all()

a    False
b    False
c     True
dtype: bool

In [ ]:
df5.dropna()

      a     b   c
0   1.0   2.0   3
3  67.0  42.0  53

In [ ]:
df5

      a     b   c
0   1.0   2.0   3
1   NaN   8.0   7
2   4.0   NaN  90
3  67.0  42.0  53

In [ ]:
df5.dropna(axis=1)

    c
0   3
1   7
2  90
3  53

In [ ]:
df5.dropna(thresh=2) # Drop sÃ³lo si faltan 2 o mÃ¡s variables

      a     b   c
0   1.0   2.0   3
1   NaN   8.0   7
2   4.0   NaN  90
3  67.0  42.0  53

In [ ]:
df5.fillna(0)

      a     b   c
0   1.0   2.0   3
1   0.0   8.0   7
2   4.0   0.0  90
3  67.0  42.0  53

In [ ]:
df5.fillna({
    'a': 0,
    'b': 10,
    'c': 20
})

      a     b   c
0   1.0   2.0   3
1   0.0   8.0   7
2   4.0  10.0  90
3  67.0  42.0  53

In [ ]:
print(df5)
df5.fillna(method='ffill') # toma el valor anterior

      a     b   c
0   1.0   2.0   3
1   NaN   8.0   7
2   4.0   NaN  90
3  67.0  42.0  53

      a     b   c
0   1.0   2.0   3
1   1.0   8.0   7
2   4.0   8.0  90
3  67.0  42.0  53

In [ ]:
df5.fillna(df5.median())

      a     b   c
0   1.0   2.0   3
1   4.0   8.0   7
2   4.0   8.0  90
3  67.0  42.0  53

In [ ]:
!wget https://bit.ly/ks-pds-csv2 -O {files_loc}/T100_AIRLINES.csv

--2020-12-15 16:04:09--  https://bit.ly/ks-pds-csv2
Resolving bit.ly (bit.ly)... 67.199.248.11, 67.199.248.10
Connecting to bit.ly (bit.ly)|67.199.248.11|:443... connected.
HTTP request sent, awaiting response... 301 Moved Permanently
Location: https://drive.google.com/uc?export=view&id=10TunyfQbYFZv8P0rStl4Z1okztqPa3S5 [following]
--2020-12-15 16:04:09--  https://drive.google.com/uc?export=view&id=10TunyfQbYFZv8P0rStl4Z1okztqPa3S5
Resolving drive.google.com (drive.google.com)... 74.125.137.100, 74.125.137.139, 74.125.137.138, ...
Connecting to drive.google.com (drive.google.com)|74.125.137.100|:443... connected.
HTTP request sent, awaiting response... 302 Moved Temporarily
Location: https://doc-14-cc-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/sqc31hsvunkt04v91dc1skka165c28fb/1608048225000/09168289428562857012/*/10TunyfQbYFZv8P0rStl4Z1okztqPa3S5?e=view [following]
Warning: wildcards not supported in HTTP.
--2020-12-15 16:04:10--  https://doc-14-cc-docs.googleusercontent.com/docs/securesc/ha0ro937gcuc7l7deffksulhg5h7mbp1/sqc31hsvunkt04v91dc1skka165c28fb/1608048225000/09168289428562857012/*/10TunyfQbYFZv8P0rStl4Z1okztqPa3S5?e=view
Resolving doc-14-cc-docs.googleusercontent.com (doc-14-cc-docs.googleusercontent.com)... 172.217.3.33, 2607:f8b0:4026:801::2001
Connecting to doc-14-cc-docs.googleusercontent.com (doc-14-cc-docs.googleusercontent.com)|172.217.3.33|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: unspecified [text/csv]
Saving to: â/content/gdrive/MyDrive/pythondsfiles/T100_AIRLINES.csvâ

/content/gdrive/MyD     [ <=>                ]   9.32M  48.2MB/s    in 0.2s

2020-12-15 16:04:11 (48.2 MB/s) - â/content/gdrive/MyDrive/pythondsfiles/T100_AIRLINES.csvâ saved [9777233]

In [ ]:
!ls {files_loc}

csv_output.csv	example.db  excel_output.xls  s3.pkl  T100_AIRLINES.csv

In [ ]:
contents = !ls {files_loc}/*T100*
contents

['/content/gdrive/MyDrive/pythondsfiles/T100_AIRLINES.csv']

In [ ]:
trafficDf = pd.read_csv(contents[0])

In [ ]:
trafficDf.head()

   DEPARTURES_SCHEDULED  DEPARTURES_PERFORMED  ...  CLASS  Unnamed: 43
0                   0.0                   1.0  ...      L          NaN
1                   0.0                   1.0  ...      L          NaN
2                   0.0                   1.0  ...      L          NaN
3                   0.0                   1.0  ...      L          NaN
4                   0.0                   1.0  ...      L          NaN

[5 rows x 44 columns]

In [ ]:
trafficDf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31482 entries, 0 to 31481
Data columns (total 44 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   DEPARTURES_SCHEDULED   31482 non-null  float64
 1   DEPARTURES_PERFORMED   31482 non-null  float64
 2   PAYLOAD                31482 non-null  float64
 3   SEATS                  31482 non-null  float64
 4   PASSENGERS             31482 non-null  float64
 5   FREIGHT                31482 non-null  float64
 6   MAIL                   31482 non-null  float64
 7   DISTANCE               31482 non-null  float64
 8   RAMP_TO_RAMP           31482 non-null  float64
 9   AIR_TIME               31482 non-null  float64
 10  UNIQUE_CARRIER         31478 non-null  object
 11  AIRLINE_ID             31478 non-null  float64
 12  UNIQUE_CARRIER_NAME    31478 non-null  object
 13  UNIQUE_CARRIER_ENTITY  31478 non-null  object
 14  REGION                 31478 non-null  object
 15  CARRIER                31482 non-null  object
 16  CARRIER_NAME           31478 non-null  object
 17  CARRIER_GROUP          31482 non-null  int64
 18  CARRIER_GROUP_NEW      31478 non-null  float64
 19  ORIGIN_AIRPORT_ID      31482 non-null  int64
 20  ORIGIN_AIRPORT_SEQ_ID  31482 non-null  int64
 21  ORIGIN_CITY_MARKET_ID  31482 non-null  int64
 22  ORIGIN                 31482 non-null  object
 23  ORIGIN_CITY_NAME       31482 non-null  object
 24  ORIGIN_COUNTRY         31482 non-null  object
 25  ORIGIN_COUNTRY_NAME    31482 non-null  object
 26  ORIGIN_WAC             31482 non-null  int64
 27  DEST_AIRPORT_ID        31482 non-null  int64
 28  DEST_AIRPORT_SEQ_ID    31482 non-null  int64
 29  DEST_CITY_MARKET_ID    31482 non-null  int64
 30  DEST                   31482 non-null  object
 31  DEST_CITY_NAME         31482 non-null  object
 32  DEST_COUNTRY           31482 non-null  object
 33  DEST_COUNTRY_NAME      31482 non-null  object
 34  DEST_WAC               31482 non-null  int64
 35  AIRCRAFT_GROUP         31482 non-null  int64
 36  AIRCRAFT_TYPE          31482 non-null  int64
 37  AIRCRAFT_CONFIG        31482 non-null  int64
 38  YEAR                   31482 non-null  int64
 39  QUARTER                31482 non-null  int64
 40  MONTH                  31482 non-null  int64
 41  DISTANCE_GROUP         31482 non-null  int64
 42  CLASS                  31482 non-null  object
 43  Unnamed: 43            0 non-null      float64
dtypes: float64(13), int64(16), object(15)
memory usage: 10.6+ MB

In [ ]:
trafficDf.describe()

       DEPARTURES_SCHEDULED  DEPARTURES_PERFORMED  ...  DISTANCE_GROUP  Unnamed: 43
count          31482.000000           31482.00000  ...    31482.000000          0.0
mean               7.679881              14.23874  ...        5.921670          NaN
std               16.939749              19.76649  ...        4.145716          NaN
min                0.000000               0.00000  ...        1.000000          NaN
25%                0.000000               2.00000  ...        3.000000          NaN
50%                0.000000               7.00000  ...        4.000000          NaN
75%                7.000000              21.00000  ...        9.000000          NaN
max              248.000000             316.00000  ...       20.000000          NaN

[8 rows x 29 columns]

In [ ]:
trafficDf.shape

(31482, 44)

In [ ]:
trafficDf.head(1000).to_excel(os.path.join(files_loc, "excel_output.xls"))

In [ ]:
!ls {files_loc}

csv_output.csv	example.db  excel_output.xls  s3.pkl  T100_AIRLINES.csv

In [ ]:
trafficDf.head(100).to_csv(os.path.join(files_loc, "csv_output.csv"))

In [ ]:
!ls {files_loc}

csv_output.csv	example.db  excel_output.xls  s3.pkl  T100_AIRLINES.csv

In [ ]:
import sqlite3
conn = sqlite3.connect(os.path.join(files_loc, 'example.db'))

In [ ]:
trafficDf.to_sql('traffic', conn, if_exists='replace')

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:2615: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [ ]:
!ls -al {files_loc}/example.db

-rw------- 1 root root 7315456 Dec 15 16:04 /content/gdrive/MyDrive/pythondsfiles/example.db

In [ ]:
trafficDf.head(2).to_dict(orient='records')

[{'AIRCRAFT_CONFIG': 1,
  'AIRCRAFT_GROUP': 6,
  'AIRCRAFT_TYPE': 622,
  'AIRLINE_ID': 21040.0,
  'AIR_TIME': 0.0,
  'CARRIER': '02Q',
  'CARRIER_GROUP': 0,
  'CARRIER_GROUP_NEW': 0.0,
  'CARRIER_NAME': 'Titan Airways',
  'CLASS': 'L',
  'DEPARTURES_PERFORMED': 1.0,
  'DEPARTURES_SCHEDULED': 0.0,
  'DEST': 'MCO',
  'DEST_AIRPORT_ID': 13204,
  'DEST_AIRPORT_SEQ_ID': 1320402,
  'DEST_CITY_MARKET_ID': 31454,
  'DEST_CITY_NAME': 'Orlando, FL',
  'DEST_COUNTRY': 'US',
  'DEST_COUNTRY_NAME': 'United States',
  'DEST_WAC': 33,
  'DISTANCE': 3160.0,
  'DISTANCE_GROUP': 7,
  'FREIGHT': 0.0,
  'MAIL': 0.0,
  'MONTH': 1,
  'ORIGIN': 'TER',
  'ORIGIN_AIRPORT_ID': 15174,
  'ORIGIN_AIRPORT_SEQ_ID': 1517403,
  'ORIGIN_CITY_MARKET_ID': 32946,
  'ORIGIN_CITY_NAME': 'Lajes, Portugal',
  'ORIGIN_COUNTRY': 'PT',
  'ORIGIN_COUNTRY_NAME': 'Portugal',
  'ORIGIN_WAC': 469,
  'PASSENGERS': 76.0,
  'PAYLOAD': 26543.0,
  'QUARTER': 1,
  'RAMP_TO_RAMP': 0.0,
  'REGION': 'I',
  'SEATS': 76.0,
  'UNIQUE_CARRIER': '02Q',
  'UNIQUE_CARRIER_ENTITY': '71004',
  'UNIQUE_CARRIER_NAME': 'Titan Airways',
  'Unnamed: 43': nan,
  'YEAR': 2020},
 {'AIRCRAFT_CONFIG': 1,
  'AIRCRAFT_GROUP': 6,
  'AIRCRAFT_TYPE': 622,
  'AIRLINE_ID': 21040.0,
  'AIR_TIME': 0.0,
  'CARRIER': '02Q',
  'CARRIER_GROUP': 0,
  'CARRIER_GROUP_NEW': 0.0,
  'CARRIER_NAME': 'Titan Airways',
  'CLASS': 'L',
  'DEPARTURES_PERFORMED': 1.0,
  'DEPARTURES_SCHEDULED': 0.0,
  'DEST': 'STN',
  'DEST_AIRPORT_ID': 15018,
  'DEST_AIRPORT_SEQ_ID': 1501806,
  'DEST_CITY_MARKET_ID': 30730,
  'DEST_CITY_NAME': 'London, United Kingdom',
  'DEST_COUNTRY': 'GB',
  'DEST_COUNTRY_NAME': 'United Kingdom',
  'DEST_WAC': 493,
  'DISTANCE': 4360.0,
  'DISTANCE_GROUP': 9,
  'FREIGHT': 0.0,
  'MAIL': 0.0,
  'MONTH': 1,
  'ORIGIN': 'MCO',
  'ORIGIN_AIRPORT_ID': 13204,
  'ORIGIN_AIRPORT_SEQ_ID': 1320402,
  'ORIGIN_CITY_MARKET_ID': 31454,
  'ORIGIN_CITY_NAME': 'Orlando, FL',
  'ORIGIN_COUNTRY': 'US',
  'ORIGIN_COUNTRY_NAME': 'United States',
  'ORIGIN_WAC': 33,
  'PASSENGERS': 0.0,
  'PAYLOAD': 26543.0,
  'QUARTER': 1,
  'RAMP_TO_RAMP': 0.0,
  'REGION': 'I',
  'SEATS': 76.0,
  'UNIQUE_CARRIER': '02Q',
  'UNIQUE_CARRIER_ENTITY': '71004',
  'UNIQUE_CARRIER_NAME': 'Titan Airways',
  'Unnamed: 43': nan,
  'YEAR': 2020}]

In [ ]:
trafficDf.head(2).to_json(orient='records')

'[{"DEPARTURES_SCHEDULED":0.0,"DEPARTURES_PERFORMED":1.0,"PAYLOAD":26543.0,"SEATS":76.0,"PASSENGERS":76.0,"FREIGHT":0.0,"MAIL":0.0,"DISTANCE":3160.0,"RAMP_TO_RAMP":0.0,"AIR_TIME":0.0,"UNIQUE_CARRIER":"02Q","AIRLINE_ID":21040.0,"UNIQUE_CARRIER_NAME":"Titan Airways","UNIQUE_CARRIER_ENTITY":"71004","REGION":"I","CARRIER":"02Q","CARRIER_NAME":"Titan Airways","CARRIER_GROUP":0,"CARRIER_GROUP_NEW":0.0,"ORIGIN_AIRPORT_ID":15174,"ORIGIN_AIRPORT_SEQ_ID":1517403,"ORIGIN_CITY_MARKET_ID":32946,"ORIGIN":"TER","ORIGIN_CITY_NAME":"Lajes, Portugal","ORIGIN_COUNTRY":"PT","ORIGIN_COUNTRY_NAME":"Portugal","ORIGIN_WAC":469,"DEST_AIRPORT_ID":13204,"DEST_AIRPORT_SEQ_ID":1320402,"DEST_CITY_MARKET_ID":31454,"DEST":"MCO","DEST_CITY_NAME":"Orlando, FL","DEST_COUNTRY":"US","DEST_COUNTRY_NAME":"United States","DEST_WAC":33,"AIRCRAFT_GROUP":6,"AIRCRAFT_TYPE":622,"AIRCRAFT_CONFIG":1,"YEAR":2020,"QUARTER":1,"MONTH":1,"DISTANCE_GROUP":7,"CLASS":"L","Unnamed: 43":null},{"DEPARTURES_SCHEDULED":0.0,"DEPARTURES_PERFORMED":1.0,"PAYLOAD":26543.0,"SEATS":76.0,"PASSENGERS":0.0,"FREIGHT":0.0,"MAIL":0.0,"DISTANCE":4360.0,"RAMP_TO_RAMP":0.0,"AIR_TIME":0.0,"UNIQUE_CARRIER":"02Q","AIRLINE_ID":21040.0,"UNIQUE_CARRIER_NAME":"Titan Airways","UNIQUE_CARRIER_ENTITY":"71004","REGION":"I","CARRIER":"02Q","CARRIER_NAME":"Titan Airways","CARRIER_GROUP":0,"CARRIER_GROUP_NEW":0.0,"ORIGIN_AIRPORT_ID":13204,"ORIGIN_AIRPORT_SEQ_ID":1320402,"ORIGIN_CITY_MARKET_ID":31454,"ORIGIN":"MCO","ORIGIN_CITY_NAME":"Orlando, FL","ORIGIN_COUNTRY":"US","ORIGIN_COUNTRY_NAME":"United States","ORIGIN_WAC":33,"DEST_AIRPORT_ID":15018,"DEST_AIRPORT_SEQ_ID":1501806,"DEST_CITY_MARKET_ID":30730,"DEST":"STN","DEST_CITY_NAME":"London, United Kingdom","DEST_COUNTRY":"GB","DEST_COUNTRY_NAME":"United Kingdom","DEST_WAC":493,"AIRCRAFT_GROUP":6,"AIRCRAFT_TYPE":622,"AIRCRAFT_CONFIG":1,"YEAR":2020,"QUARTER":1,"MONTH":1,"DISTANCE_GROUP":9,"CLASS":"L","Unnamed: 43":null}]'

In [ ]:
df2 = pd.read_excel(os.path.join(files_loc, "excel_output.xls"))

In [ ]:
df2.head()

   Unnamed: 0  DEPARTURES_SCHEDULED  ...  CLASS  Unnamed: 43
0           0                     0  ...      L          NaN
1           1                     0  ...      L          NaN
2           2                     0  ...      L          NaN
3           3                     0  ...      L          NaN
4           4                     0  ...      L          NaN

[5 rows x 45 columns]

In [ ]:
# Eliminar la primera columna

df2 = df2.loc[:, ~df2.columns.str.contains('^Unnamed')]
df2.head()

   DEPARTURES_SCHEDULED  DEPARTURES_PERFORMED  ...  DISTANCE_GROUP  CLASS
0                     0                     1  ...               7      L
1                     0                     1  ...               9      L
2                     0                     1  ...               8      L
3                     0                     1  ...               8      L
4                     0                     1  ...               8      L

[5 rows x 43 columns]

In [ ]:
# Cargar el Excel directamente sin la primera columna

df2 = pd.read_excel(os.path.join(files_loc, "excel_output.xls"), index_col=0)
df2.head()

   DEPARTURES_SCHEDULED  DEPARTURES_PERFORMED  ...  CLASS  Unnamed: 43
0                     0                     1  ...      L          NaN
1                     0                     1  ...      L          NaN
2                     0                     1  ...      L          NaN
3                     0                     1  ...      L          NaN
4                     0                     1  ...      L          NaN

[5 rows x 44 columns]

### The challenge

Dataset de accidentes de Madrid

In [3]:
!wget https://datos.madrid.es/egob/catalogo/207831-0-accidentes-trafico.xls -P {files_loc}

--2020-12-16 17:58:18--  https://datos.madrid.es/egob/catalogo/207831-0-accidentes-trafico.xls
Resolving datos.madrid.es (datos.madrid.es)... 104.119.189.155, 104.119.189.153, 2600:1407:7800::6877:bd99, ...
Connecting to datos.madrid.es (datos.madrid.es)|104.119.189.155|:443... connected.
HTTP request sent, awaiting response... 302 Moved Temporarily
Location: https://datos.madrid.es:443/egobfiles/MANUAL/207831/01_%20ACCIDENTES%20POR%20TIPO%20EN%20%20DISTRITOS.xls [following]
--2020-12-16 17:58:19--  https://datos.madrid.es/egobfiles/MANUAL/207831/01_%20ACCIDENTES%20POR%20TIPO%20EN%20%20DISTRITOS.xls
Reusing existing connection to datos.madrid.es:443.
HTTP request sent, awaiting response... 200 OK
Length: unspecified [application/vnd.ms-excel]
Saving to: â/content/gdrive/MyDrive/pythondsfiles/207831-0-accidentes-trafico.xls.1â

207831-0-accidentes     [ <=>                ]  60.50K  --.-KB/s    in 0.01s

2020-12-16 17:58:19 (4.41 MB/s) - â/content/gdrive/MyDrive/pythondsfiles/207831-0-accidentes-trafico.xls.1â saved [61952]

In [30]:
contents = !ls {files_loc}/*accidentes*
file_path = contents[1]

In [31]:
df_accidentes = pd.read_excel(file_path)
df_accidentes.head(15)

   01. ACCIDENTES POR TIPO EN DISTRITOS  ... Unnamed: 12
0                                   NaN  ...         NaN
1                                   NaN  ...         NaN
2                                   NaN  ...         NaN
3                                   NaN  ...         NaN
4                           Indicadores  ...         NaN
5                                   AÃ±o  ...         NaN
6                    DISTRITO_ACCIDENTE  ...         NaN
7        ARGANZUELA                      ...         NaN
8        BARAJAS                         ...         NaN
9        CARABANCHEL                     ...         NaN
10       CENTRO                          ...         NaN
11       CHAMARTIN                       ...         NaN
12       CHAMBERI                        ...         NaN
13       CIUDAD LINEAL                   ...         NaN
14       FUENCARRAL-EL PARDO             ...         NaN

[15 rows x 13 columns]

In [12]:
df_accidentes.columns

Index(['01. ACCIDENTES POR TIPO EN DISTRITOS', 'Unnamed: 1', 'Unnamed: 2',
       'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7',
       'Unnamed: 8', 'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11'],
      dtype='object')

In [13]:
# Cargar la hoja '2016', evitando las 7 primeras filas y seleccionando las columnas de la A a la L

df_accidentes = pd.read_excel(file_path, sheet_name='2016', index_col=0, skiprows=7, skipfooter=1, usecols='A:L')

df_accidentes.head()

                                COLISIÃN DOBLE                            ...  CAÃDA VEHÃCULO 3 RUEDAS
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           328  ...                                       NaN
BARAJAS                                                               95  ...                                       NaN
CARABANCHEL                                                          346  ...                                       NaN
CENTRO                                                               444  ...                                       NaN
CHAMARTIN                                                            499  ...                                       NaN

[5 rows x 11 columns]

In [14]:
# Datos de 2010

accidentes_2010 = pd.read_excel(file_path, 
                                index_col=0, 
                                header=7, 
                                sheet_name='2010', 
                                skipfooter=1,
                                usecols='A:K')
accidentes_2010

                                COLISIÃN DOBLE                            ...  OTRAS CAUSAS
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           403  ...                                       6.0
BARAJAS                                                               62  ...                                       NaN
CARABANCHEL                                                          357  ...                                       1.0
CENTRO                                                               546  ...                                       9.0
CHAMARTIN                                                            460  ...                                       5.0
CHAMBERI                                                             361  ...                                       4.0
CIUDAD LINEAL                                                        404  ...                                       2.0
FUENCARRAL-EL PARDO                                                  294  ...                                       2.0
HORTALEZA                                                            183  ...                                       3.0
LATINA                                                               273  ...                                       4.0
MONCLOA-ARAVACA                                                      350  ...                                      11.0
MORATALAZ                                                            127  ...                                       1.0
PUENTE DE VALLECAS                                                   324  ...                                       7.0
RETIRO                                                               349  ...                                       5.0
SALAMANCA                                                            506  ...                                       6.0
SAN BLAS                                                             274  ...                                       2.0
TETUAN                                                               331  ...                                       3.0
USERA                                                                178  ...                                       4.0
VICALVARO                                                             65  ...                                       5.0
VILLA DE VALLECAS                                                    124  ...                                       3.0
VILLAVERDE                                                           147  ...                                       1.0

[21 rows x 10 columns]

In [15]:
# Con sheet_name=None cargamos todo el libro y seleccionamos asÃ­ cada hoja 

all_accidents = pd.read_excel(file_path, index_col=0, header=7, sheet_name=None)
all_accidents['2010'].head()

                                COLISIÃN DOBLE                            ...  Unnamed: 11
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           403  ...          690
BARAJAS                                                               62  ...          135
CARABANCHEL                                                          357  ...          696
CENTRO                                                               546  ...         1007
CHAMARTIN                                                            460  ...          858

[5 rows x 11 columns]

In [16]:
# Iterar sobre todos los elementos

for k, v in all_accidents.items():
    print(v)

                                COLISIÃN DOBLE                            ...  Unnamed: 11
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           389  ...          722
BARAJAS                                                               89  ...          188
CARABANCHEL                                                          375  ...          807
CENTRO                                                               514  ...          981
CHAMARTIN                                                            494  ...          908
CHAMBERI                                                             414  ...          702
CIUDAD LINEAL                                                        398  ...          777
FUENCARRAL-EL PARDO                                                  321  ...          675
HORTALEZA                                                            215  ...          458
LATINA                                                               298  ...          620
MONCLOA-ARAVACA                                                      340  ...          766
MORATALAZ                                                            151  ...          311
PUENTE DE VALLECAS                                                   367  ...          801
RETIRO                                                               369  ...          635
SALAMANCA                                                            535  ...          965
SAN BLAS                                                             301  ...          527
TETUAN                                                               338  ...          655
USERA                                                                214  ...          411
VICALVARO                                                             86  ...          172
VILLA DE VALLECAS                                                    142  ...          272
VILLAVERDE                                                           148  ...          307
Total                                                               6498  ...        12660

[22 rows x 11 columns]
                                COLISIÃN DOBLE                            ...  Unnamed: 11
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           403  ...          690
BARAJAS                                                               62  ...          135
CARABANCHEL                                                          357  ...          696
CENTRO                                                               546  ...         1007
CHAMARTIN                                                            460  ...          858
CHAMBERI                                                             361  ...          676
CIUDAD LINEAL                                                        404  ...          767
FUENCARRAL-EL PARDO                                                  294  ...          636
HORTALEZA                                                            183  ...          343
LATINA                                                               273  ...          552
MONCLOA-ARAVACA                                                      350  ...          739
MORATALAZ                                                            127  ...          268
PUENTE DE VALLECAS                                                   324  ...          686
RETIRO                                                               349  ...          572
SALAMANCA                                                            506  ...          900
SAN BLAS                                                             274  ...          468
TETUAN                                                               331  ...          608
USERA                                                                178  ...          398
VICALVARO                                                             65  ...          177
VILLA DE VALLECAS                                                    124  ...          252
VILLAVERDE                                                           147  ...          300
Total                                                               6118  ...        11728

[22 rows x 11 columns]
                                COLISIÃN DOBLE                            ...  Unnamed: 11
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           373  ...          654
BARAJAS                                                               78  ...          171
CARABANCHEL                                                          381  ...          726
CENTRO                                                               528  ...         1007
CHAMARTIN                                                            514  ...          888
CHAMBERI                                                             414  ...          712
CIUDAD LINEAL                                                        371  ...          787
FUENCARRAL-EL PARDO                                                  312  ...          643
HORTALEZA                                                            189  ...          391
LATINA                                                               285  ...          567
MONCLOA-ARAVACA                                                      290  ...          683
MORATALAZ                                                            137  ...          269
PUENTE DE VALLECAS                                                   344  ...          752
RETIRO                                                               367  ...          658
SALAMANCA                                                            528  ...          940
SAN BLAS                                                             285  ...          505
TETUAN                                                               321  ...          589
USERA                                                                179  ...          369
VICALVARO                                                             73  ...          167
VILLA DE VALLECAS                                                    129  ...          237
VILLAVERDE                                                           140  ...          288
Total                                                               6238  ...        12003

[22 rows x 11 columns]
                                COLISIÃN DOBLE                            ...  Unnamed: 11
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           376  ...          631
BARAJAS                                                               82  ...          159
CARABANCHEL                                                          350  ...          718
CENTRO                                                               491  ...          917
CHAMARTIN                                                            464  ...          841
CHAMBERI                                                             418  ...          711
CIUDAD LINEAL                                                        391  ...          711
FUENCARRAL-EL PARDO                                                  317  ...          670
HORTALEZA                                                            170  ...          367
LATINA                                                               248  ...          548
MONCLOA-ARAVACA                                                      292  ...          678
MORATALAZ                                                            134  ...          286
PUENTE DE VALLECAS                                                   340  ...          713
RETIRO                                                               370  ...          626
SALAMANCA                                                            633  ...         1033
SAN BLAS                                                             265  ...          494
TETUAN                                                               324  ...          577
USERA                                                                182  ...          378
VICALVARO                                                             64  ...          157
VILLA DE VALLECAS                                                    119  ...          238
VILLAVERDE                                                           140  ...          293
Total                                                               6170  ...        11746

[22 rows x 11 columns]
                                 366   40   143    98  ...   12     5   3.1    709
CARABANCHEL                                            ...
CENTRO                           482   33   159   138  ...   12  10.0   2.0    926
CHAMARTIN                        451   82   121    86  ...    2   5.0   4.0    844
CHAMBERI                         414   30    67    91  ...    7   4.0   5.0    715
CIUDAD LINEAL                    396   52   128    75  ...    6   4.0   4.0    750
FUENCARRAL-EL PARDO              335   42   159    72  ...   13   2.0   4.0    682
HORTALEZA                        171   18    77    51  ...   10   1.0   2.0    374
LATINA                           248   29   110    95  ...    4   5.0   7.0    530
MONCLOA-ARAVACA                  300   65   168    59  ...   13   9.0   4.0    702
MORATALAZ                        132   14    39    53  ...    5   1.0   3.0    282
PUENTE DE VALLECAS               334   37   125    94  ...    8   4.0   1.0    651
RETIRO                           364   59    50    50  ...   11   2.0   3.0    593
SALAMANCA                        570   70   133    89  ...    8   6.0   5.0    982
SAN BLAS                         286   16    84    72  ...   13   2.0   1.0    518
TETUAN                           314   35    69    84  ...    3   4.0   2.0    594
USERA                            204   28    70    59  ...    1   3.0   2.0    387
VICALVARO                         73    4    47    25  ...    2   NaN   3.0    172
VILLA DE VALLECAS                124    4    59    40  ...    1   1.0   2.0    250
VILLAVERDE                       163   11    58    64  ...    1   NaN   NaN    307
Total                           6157  723  1975  1486  ...  140  76.0  61.0  11749

[19 rows x 11 columns]
                                COLISIÃN DOBLE                            ...  Unnamed: 11
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           335  ...          616
BARAJAS                                                               76  ...          146
CARABANCHEL                                                          351  ...          714
CENTRO                                                               458  ...          939
CHAMARTIN                                                            455  ...          838
CHAMBERI                                                             399  ...          697
CIUDAD LINEAL                                                        380  ...          757
FUENCARRAL-EL PARDO                                                  295  ...          644
HORTALEZA                                                            188  ...          410
LATINA                                                               257  ...          583
MONCLOA-ARAVACA                                                      304  ...          677
MORATALAZ                                                            130  ...          291
PUENTE DE VALLECAS                                                   351  ...          706
RETIRO                                                               350  ...          621
SALAMANCA                                                            547  ...          981
SAN BLAS                                                             298  ...          543
TETUAN                                                               333  ...          645
USERA                                                                196  ...          409
VICALVARO                                                             72  ...          158
VILLA DE VALLECAS                                                    136  ...          272
VILLAVERDE                                                           145  ...          288
Total                                                               6056  ...        11935

[22 rows x 11 columns]
                                COLISIÃN DOBLE                            ...  Unnamed: 11
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           340  ...          600
BARAJAS                                                               77  ...          185
CARABANCHEL                                                          367  ...          725
CENTRO                                                               474  ...          929
CHAMARTIN                                                            504  ...          904
CHAMBERI                                                             386  ...          657
CIUDAD LINEAL                                                        387  ...          761
FUENCARRAL-EL PARDO                                                  324  ...          639
HORTALEZA                                                            221  ...          440
LATINA                                                               289  ...          583
MONCLOA-ARAVACA                                                      287  ...          664
MORATALAZ                                                            132  ...          272
PUENTE DE VALLECAS                                                   365  ...          751
RETIRO                                                               332  ...          601
SALAMANCA                                                            447  ...          849
SAN BLAS                                                             283  ...          495
TETUAN                                                               355  ...          636
USERA                                                                199  ...          387
VICALVARO                                                             77  ...          151
VILLA DE VALLECAS                                                    129  ...          255
VILLAVERDE                                                           146  ...          298
Total                                                               6121  ...        11782

[22 rows x 11 columns]
                                COLISIÃN DOBLE                            ...  Unnamed: 12
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           328  ...          610
BARAJAS                                                               95  ...          213
CARABANCHEL                                                          346  ...          725
CENTRO                                                               444  ...          932
CHAMARTIN                                                            499  ...          904
CHAMBERI                                                             382  ...          647
CIUDAD LINEAL                                                        411  ...          787
FUENCARRAL-EL PARDO                                                  345  ...          692
HORTALEZA                                                            248  ...          472
LATINA                                                               288  ...          622
MONCLOA-ARAVACA                                                      294  ...          709
MORATALAZ                                                            150  ...          307
PUENTE DE VALLECAS                                                   386  ...          811
RETIRO                                                               344  ...          647
SALAMANCA                                                            467  ...          951
SAN BLAS                                                             299  ...          501
TETUAN                                                               330  ...          653
USERA                                                                206  ...          412
VICALVARO                                                             70  ...          161
VILLA DE VALLECAS                                                    149  ...          295
VILLAVERDE                                                           177  ...          336
Total                                                               6258  ...        12387

[22 rows x 12 columns]

In [17]:
type(all_accidents)

dict

#### Exercise

Consolidate the excel into one DataFrame:
- You will need to create a 'YEAR' column.
- Think how you can iterate through all the DataFrames.
- Explore also where you can take the value of 'YEAR' from, from the comments in the code above it should be clear by now.

In [33]:
# Cambiando a mano la pestaÃ±a '2013' (insertando 3 filas)

datos = pd.DataFrame()
diccionario = pd.read_excel(file_path, index_col=0, header=7, sheet_name=None, usecols='A:K')

for nombre,columna in diccionario.items():
  columna['Year'] = nombre
  datos = datos.append(columna)

datos

                                COLISIÃN DOBLE                            ...  Year
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           389  ...  2009
BARAJAS                                                               89  ...  2009
CARABANCHEL                                                          375  ...  2009
CENTRO                                                               514  ...  2009
CHAMARTIN                                                            494  ...  2009
...                                                                  ...  ...   ...
USERA                                                                206  ...  2016
VICALVARO                                                             70  ...  2016
VILLA DE VALLECAS                                                    149  ...  2016
VILLAVERDE                                                           177  ...  2016
Total                                                               6258  ...  2016

[176 rows x 11 columns]

In [41]:
# Eliminar las filas con los totales

datos.drop(['Total'])

                                COLISIÃN DOBLE                            ...  Year
DISTRITO_ACCIDENTE                                                        ...
ARGANZUELA                                                           389  ...  2009
BARAJAS                                                               89  ...  2009
CARABANCHEL                                                          375  ...  2009
CENTRO                                                               514  ...  2009
CHAMARTIN                                                            494  ...  2009
...                                                                  ...  ...   ...
TETUAN                                                               330  ...  2016
USERA                                                                206  ...  2016
VICALVARO                                                             70  ...  2016
VILLA DE VALLECAS                                                    149  ...  2016
VILLAVERDE                                                           177  ...  2016

[168 rows x 11 columns]